{
  "_debug_version": "v3-with-fields",
  "name": "Dar-e-Zainab (as)",
  "domain": "https://dez-lectures.netlify.app/",
  "key_takeaways": true,
  "summary_video": true,
  "full_video": true,
  "detailed_notes": true,
  "activity": false,
  "logo_url": "https://dlmcxxzohervnbixauhs.supabase.co/storage/v1/object/public/center-logos/DEZ-1745520709006.jpg",
  "is_active": true,
  "status": "active",
  "google_sheet_id": "https://docs.google.com/spreadsheets/d/1QG4gts3BHd8dypmxuMiybIhsl8wq_jqjMDfqgZoeaqc/edit?gid=0#gid=0",
  "youtube_channel_url": "https://www.youtube.com/@lightofreflection",
  "google_drive_folder_id": "1kac8S2gd4avjdMNCoNEFblYszI8kv77B",
  "colors": {
    "primary": "#3891a3",
    "secondary": "#8E9196",
    "background": "#FFFFFF",
    "foreground": "#222222",
    "accent": "#33C3F0"
  },
  "about_us_enabled": true,
  "support_enabled": true,
  "about_us_content": {
    "intro": "Inspired by the unyielding courage of Syeda Zainab AS",
    "vision": "Inspired by the unyielding courage of Syeda Zainab AS, Dar-e-Zainab envisions a world where the profound teachings and historical narratives of Ahlul Bayt AS resonate freely, unapologetically, and without the constraints of political correctness. We believe that true change cannot come until a critical mass of humans aligns in the direction of Ahlul Bayt AS with deep maarfah.",
    "mission": "Our mission is to equip the future generation with a robust foundation of knowledge, dispelling misconceptions through open dialogue, and fostering future leaders rooted in the principles of Ahlul Bayt AS. At the heart of our vision is the desire to foster an environment of community that transcends familial ties, creating a framework of fraternal brotherhood where the bond of Wilayah of Ahlul Bayt is cherished as the most profound bond possible.",
    "approach": "As pioneers in our approach, we aim to create a future where our model had been replicated, emphasizing true maarfah, empowering individuals to lead lives of purpose, strength, and service to the oppressed, all while upholding the full practices of Islam. Our legacy will be one of transformation, laying the groundwork for a movement that prepares hearts and minds for the Hujjah of Allah, ensuring that the message and teachings of Ahlul Bayt AS are accessible to all."
  },
  "support_options": {
    "bank": {
      "info": "Bank Transfer\nAccount #: 3810 6924 5211\nRouting #: 021200339"
    },
    "card": {
      "link": ""
    },
    "zelle": {
      "email": "zainab.imam.bargah@gmail.com"
    },
    "paypal": {
      "link": "https://www.paypal.com/donate/?hosted_button_id=SJMBMEZBV5D7L"
    },
    "monthly": {
      "link": "https://buy.stripe.com/14k2bh9j435fga44gg"
    },
    "in_person": {
      "text": "In Person at Dar-e-Zainab We accept Checks, Cash, or Credit Card"
    }
  },
  "message": "Welcome to Dar-e-Zainab (as)"
}